app/controllers/items_controller.rb

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
---
  def show
    @item = Item.find params[:id]

INSERT INTO `items` (`name`, `created_at`, `updated_at`) VALUES ('kitter', '2015-03-05 02:04:25.328768', '2015-03-05 02:04:25.328768')
---
  def create
    @item = Item.new item_params
    @item.save

UPDATE `items` SET `image_file_name` = 'imgres.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 14804, `image_updated_at` = '2015-03-05 21:25:39.580801', `updated_at` = '2015-03-05 21:25:39.771849' WHERE `items`.`id` = 2
---
  def update
    @item.update_attributes item_params

DELETE FROM `items` WHERE `items`.`id` = 13
---
  def destroy
    @item.destroy

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 13 LIMIT 1
---
  def set_item
    @item = Item.find params[:id]